{
  "_name_or_path": "/checkpoint/amaia/video/davidfan/shared_checkpoints/webssl/webssl_mae1b_full2b_224/hugging_face",
  "architectures": [
    "ViTModel"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 1536,
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 6144,
  "layer_norm_eps": 1e-06,
  "mask_ratio": 0.0,
  "model_type": "vit",
  "num_attention_heads": 24,
  "num_channels": 3,
  "num_hidden_layers": 40,
  "patch_size": 14,
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.46.2"
}
